Revit 2024 API
RepeaterCoordinates Members
The RepeaterCoordinates type exposes the following members.
Constructors
Name | Description
RepeaterCoordinates()
 Creates zero dimensional coordinates.
RepeaterCoordinates(Int32)
 Creates one dimensional coordinates.
RepeaterCoordinates(Int32, Int32)
 Creates two dimensional coordinates.
Methods
Name | Description
Dispose
Releases all resources used by the RepeaterCoordinates
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetCoordinate
 Returns the coordinate in the given dimension.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
DimensionCount
 The number of dimensions of the coordinates (0, 1 or 2 for zero, one or two dimensional arrays.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
RepeaterCoordinates Class
Autodesk.Revit.DB Namespace